libxmlbus/data/wsaddr-testset/documents/echo/soap11/message4.xml

<?xml version="1.0"?>
<!-- $Id: message4.xml,v 1.4 2006/01/19 06:05:30 hugo Exp $ -->
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <env:Header>
    <wsa:Action>http://example.org/action/echoIn</wsa:Action>
    <wsa:MessageID>BF6275A8-4D17-4C91-8759-8137583F654B</wsa:MessageID>
    <wsa:ReplyTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <wsa:FaultTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:FaultTo>
  </env:Header>
  <env:Body>
    <m:echoIn xmlns:m="http://example.org/echo">Echo This Text</m:echoIn>
  </env:Body>
</env:Envelope>
