libxmlbus/data/wsaddr-testset/documents/echo/soap12/message1-70.xml

<?xml version="1.0"?>
<!-- $Id: message1-70.xml,v 1.1 2006/03/03 09:34:03 hugo Exp $ -->
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <env:Header>
    <wsa:To>http://example.org/node/A</wsa:To>
    <wsa:Action>http://example.org/action/echoIn</wsa:Action>
    <wsa:MessageID>urn:uuid:6175992B-1EC9-42AA-9C18-C0C9F2E6B9DD</wsa:MessageID>
    <wsa:From env:mustUnderstand="true">
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:From>
  </env:Header>
  <env:Body>
    <m:echoIn xmlns:m="http://example.org/echo">Echo This Text</m:echoIn>
  </env:Body>
</env:Envelope>
